# FailureResolution Properties

---
The FailureResolution type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FailureResolution Class
Autodesk.Revit.DB Namespace